Repository: mozilla-l10n/mt-training-data
Catalog: zu/zu_pontoon.tmx
Source language: en_us
Languages: zu

source: Add-ons
zu: Okungangezwa

source: Get Involved
zu: Zibandakanye

source: 1 Review
zu: 1Isibukezo

source: Adults Only 18+
zu: Abadala abanengu- 18+ Kuphela

source: All Platforms
zu: Zonke Izithangami

source: Android Mobile
zu: I-Android Mobile

source: Android Tablet
zu: I-Android Tablet

source: An error occurred.
zu: Kube nephutha.

source: An internal server error occurred. Please try again later.
zu: Kube nephutha langaphakathi kuseva. Uyacelwa uphinde uzame ngesinye isikhathi.

source: An update to Marketplace is available.
zu: Kukhona okusha osekutholakala ku-Marketplace.

source: App for Albania
zu: I-app yase-Albania

source: App for Argentina
zu: I-app yase-Argentina

source: App for Bangladesh
zu: I-app yase-Bangladesh

source: App for Brazil
zu: I-app yase-Brazil

source: App for Bulgaria
zu: Ama-app ase-Bulgaria

source: App for Chile
zu: I-app yase-Chile

source: App for China
zu: I-app yase-Columbia

source: App for Colombia
zu: Ama-app ase-Columbia

source: App for Costa Rica
zu: Ama-app ase-Costa Rica

source: App for Croatia
zu: Ama-app ase-Croatia

source: App for Czech Republic
zu: I-app yase-Czech Republic

source: App for Ecuador
zu: I-app yase-Ecuador

source: App for El Salvador
zu: I-app yase-El Salvador

source: App for France
zu: I-app yase-France

source: App for Germany
zu: I-app yase-Germany

source: App for Greece
zu: Ama-app ase-Greece

source: App for Hungary
zu: I-app yase-Hungary

source: App for India
zu: Ama-app ase-India

source: App for Italy
zu: Ama-app ase-Italy

source: App for Japan
zu: Ama-app ase-Japan

source: App for Macedonia
zu: Ama-app ase-Macedonia

source: App for Mexico
zu: I-app yase-Mexico

source: App for Montenegro
zu: I-app yase-Montenegro

source: App for Nicaragua
zu: Ama-app ase-Nicaragua

source: App for Panama
zu: I-app yase-Panama

source: App for Peru
zu: Ama-app ase-Peru

source: App for Poland
zu: I-app yase-Poland

source: App for Russia
zu: Ama-app ase-Russia

source: App for Serbia
zu: Ama-app ase-Serbia

source: App for South Africa
zu: Ama-app ase-South Africa

source: App for Spain
zu: Ama-app ase-Spain

source: App for Uruguay
zu: Ama-app ase-Uruguay

source: App for Venezuela
zu: Ama-app ase-Venezuela

source: App install error: {error}
zu: Iphutha lokufakela i-app: {error}

source: {app_name} screenshot
zu: {app_name} isithombe seskrini

source: App not yet reviewed
zu: I-app ayikabukezwa okwamanje

source: App Review
zu: Ukubukezwa Kwe-App

source: Approve / Reject
zu: Vumela / Nqabela

source: App Statistics
zu: Izibalo zama-App

source: App usage statistics
zu: Ukusetshenziswa kwezibalo zama-App

source: Arts & Entertainment App
zu: I-App Yezobuciko & Eyezikaqedisizungu

source: Back to app
zu: Buyela emuva ku-app

source: Back to {app}
zu: Emuva ku-{app}

source: <b>{n}</b> Result
zu: <b>{n}</b> Imiphumela

source: <b>"{search_query}"</b> returned {n} result
zu: <b>"{search_query}"</b> kubuyiswe {n} imiphumela

source: Business
zu: Ezamabhizinisi

source: Cancel
zu: Khansela

source: Categories
zu: Izigaba

source: Compatibility
zu: Ukufaneleka

source: Content Rating
zu: Ukulinganisela Okuqukethwe

source: Currently Offline
zu: Okwamanje awukho emoyeni

source: Delete
zu: Dilitha

source: Description
zu: Incazelo

source: Desktop
zu: Idesktop

source: Develop Apps
zu: Sungula ama-App

source: Developer
zu: Umthuthukisi

source: Display Name
zu: Veza Igama

source: Download
zu: Dawuniloda

source: Edit
zu: Hlela

source: Edit Listing
zu: Hlela Uhla

source: Edit Review
zu: Hlola Isibukezo

source: Edit your review
zu: Hlela isibukezo sakho

source: Edit your Review
zu: Hlela Ukubukeza kwakho

source: Education
zu: Ezemfundo

source: Email
zu: I-imeyli

source: Email Address
zu: Ikheli le-imeyli

source: Email Support
zu: Ukwesekwa nge-imeyli

source: English
zu: IsiNgisi

source: Entertainment
zu: Ezikaqedisizungu

source: Error while communicating with server. Try again later.
zu: Kube nenkinga ngenkathi kuxhunywana neseva. Phinda uzame futhi emva kwesikhathi.

source: Everyone
zu: Wonke umuntu

source: Everyone 10+
zu: Wonke umuntu onengu-10+

source: Except where otherwise <a href="{legal_url}" target="_blank">noted</a>, content on this site is licensed under the <a href="{cc_url}" target="_blank">Creative Commons Attribution Share-Alike License v3.0</a> or any later version.
zu: Ngaphandle kwalapho <a href="{legal_url}" target="_blank">kubhaliwe</a>, okuqukethwe kule sayithi kungaphansi kwelayisensi <a href="{cc_url}" target="_blank">i-Creative Commons Attribution Share-Alike License v3.0</a> noma nayiphi iveshini yakamuva.

source: Expand
zu: Nweba

source: Featured Book App
zu: I-app Yencwadi Efakiwe

source: Featured Creativity App
zu: I-app Yobuciko Efakiwe

source: Featured Education App
zu: Ama-app Emfundo Afakiwe

source: Featured Game
zu: Umdlalo Ofakiwe

source: Featured Lifestyle App
zu: Ama-App Esitayela Sempilo Afakiwe

source: Featured Music App
zu: Ama-App Omculo Afakiwe

source: Featured Shopping App
zu: I-App Yokuthenga Efakiwe

source: Featured Social App
zu: I-App Yokomphakathi Efakiwe

source: Featured Sports App
zu: I-App Yezemidlalo Efakiwe

source: Featured Travel App
zu: I-App Yezokuvakasha Efakiwe

source: Feedback
zu: Imbuyisambiko

source: Feedback submitted. Thanks!
zu: Imbuyisambiko ithunyelwe. Siyabonga!

source: File Size
zu: Usayizi Wefayela

source: Firefox OS
zu: I-Firefox OS

source: Firefox OS {version}
zu: I-Firefox OS {iveshini}

source: Flagged for review
zu: Ifulegelwe ukubukezwa

source: Flagging review...
zu: Kufakwa ifulegi esibukezweni...

source: Flag Review
zu: Faka ifulegi Esibukezweni

source: For ages {0}+
zu: Eyabeminyaka engu- {0}+

source: For all ages
zu: Kweminyaka yonke

source: For previous version {version}
zu: Okweveshini yangaphambilini {iveshini}

source: Free
zu: Mahhala/Okungasebenzile

source: French
zu: IsiFulentshi

source: Games
zu: Imidlalo

source: General settings
zu: Amasethingi ajwayelekile

source: Generic
zu: Okujwayelekile

source: German
zu: IsiJalimane

source: Get Firefox News.
zu: Thola izindaba ze-Firefox.

source: Get Firefox news! Sign up for our newsletter
zu: Thola izindaba ze-Firefox! Sayinela ukuthola incwadindaba

source: Get Help
zu: Thola usizo

source: Give us your feedback. Let us know whether we are awesome or buggy.
zu: Sitshele okucabangayo. Sazise ukuthi senza kahle noma asenzi kahle.

source: Groundbreaking App
zu: I-app Engundabuzekwayo

source: Health & Fitness
zu: Impilo & Nokuqina komzimba

source: Health & Fitness App
zu: I-app Yempilo Nokuqina komzimba

source: Hidden Gem
zu: Ama-Gem Afihlekile

source: Home
zu: Ekhaya

source: Homepage
zu: Ikhasi Lasekhaya

source: Hungarian
zu: IsiHangari

source: I'm okay with Mozilla handling my info as explained in <a href="{privacy_policy_url}" target="_blank">this Privacy Policy</a>.
zu: Kulungile ukuba i-Mozilla iphathe imininingwane yami njengoba kuchaziwe ku <a href="{privacy_policy_url}" target="_blank">this Privacy Policy</a>.

source: Inappropriate language/dialog
zu: Ulimi olungalungile/inkulumo-mpendulwano

source: Indonesian
zu: Isi-Indoneshiya

source: Install
zu: Fakela

source: Installed
zu: Kufakeliwe

source: Installed!
zu: Kufakeliwe!

source: Install failed. Please try again later.
zu: Ukufakela kufeyilile. Uyacelwa uphinde uzame emva kwesikhathi.

source: Language Packs
zu: Amaqoqo Olimi

source: Last updated
zu: Igcine ukuvuselelwa

source: Launch this app from your <b>Applications</b> directory.
zu: Qalisa ukusebenza kwale app ohlwini lwakho <b>Ama-Application</b>

source: Launch this app from your <b>dash</b>, <b>Application picker</b>, or <b>Applications menu</b>.
zu: Qalisa ukusebenza kwale app kweyakho <b>dash</b>, <b>Isiqoki se-Application </b>, noma<b>imenyu yama-Application </b>.

source: Launch this app from your <b>Windows desktop</b> or <b>Start &#9658; All Programs</b>.
zu: Qalisa ukusebenza kwale app kweyakho i<b>i-Windows desktop</b> noma <b>Qala&#9658; Zonke Izinhlelo</b>.

source: Learn how to change them.
zu: Funda ukuba ashintshwa kanjani

source: Leave a Review
zu: Shiya Isibukezo

source: Let us know...
zu: Sazise...

source: Lifestyle
zu: Isitayela sempilo

source: Loading...
zu: Isaloda...

source: Loading Privacy Policy...
zu: Kusalodwa Inqubomgomo Yokuvikeleka Kwemininingwane...

source: Load more
zu: Iyaloda okunye

source: Local Favorite App
zu: Ama-App Asendaweni Ayintandokazi

source: Lookup Tool
zu: Ithuluzi Lokucinga

source: Maps & Navigation
zu: Amabalazwe & Imiyalelondlela

source: Maps & Navigation App
zu: I-App Yamabalazwe & Imiyalelondlela

source: Mature 17+
zu: Intsha endadlana 17+

source: Misplaced bug report or support request
zu: Umbiko olahlekile wokungahambi kahle noma isicelo sokwesekwa

source: More Information
zu: Imininingwane eyengeziwe

source: Most Recent Version
zu: Iveshini Yakamuva Kakhulu

source: Music
zu: Umculo

source: My Apps
zu: Ama-app Ami

source: Mystery App!
zu: Ama-App Ayimpica

source: My Submissions
zu: Okulethwe Yimi

source: Need to report something?
zu: Kukhona odinga ukukubika?

source: New
zu: Okusha

source: Newsletter
zu: Incwadindaba

source: News & Weather App
zu: I-App Yezindaba & Isimo Sezulu

source: No apps found.
zu: Awekho ama-app atholakele.

source: No language packs found.
zu: Akukho maqoqo olimi atholakele.

source: No results found
zu: Akupho miphumela etholakele

source: No results found, try again later
zu: Akukho miphumela etholakele, uphinde uzame emva kwesikhathi

source: Not enough statistics to show.
zu: Azikho izibalo ezenele ezingakhonjiswa.

source: Not yet reviewed
zu: Akukabukezwa

source: {n} star
zu: {n} inkanyezi

source: Oh no!
zu: Hawu!

source: Only users that are logged in may submit reviews.
zu: Ngabasebenzisi abasayinele ukungena kuphela abangaletha izibukezo.

source: Payment cancelled.
zu: Ukukhokha kukhanseliwe.

source: Payment failed. Try again later.
zu: Ukukhokha akuphumelelanga. Phinda uzame futhi emva kwesikhathi.

source: Photo & Video
zu: Isithombe & Amavidiyo

source: Photo & Video App
zu: Ama-App Ezithombe & Amavidiyo

source: Please set today's date and time in your device settings to access the Marketplace.
zu: Uyacelwa usethe usuku lwanamuhla kanye nesikhathi kumasethingi edivayisi yakho ukuze ukwazi ukufinyelela ku-Marketplace.

source: Please sign in to view the receipt
zu: Uyacelwa ukuba usayinele ukungena ukuze ukwazi ukubona ilisidi

source: Polish
zu: IsiPholishi

source: Popular
zu: Okunedumela

source: Portuguese
zu: IsiPutukezi

source: Premium version available
zu: Iyatholakala iveshini ephambili

source: Privacy Policy
zu: Inqubomgomo Yokuvikeleka Kwemininingwane

source: Productivity
zu: Ukukhiqiza

source: Rate:
zu: Linganisela:

source: Rated {stars} out of {maxstars} stars
zu: Kulinganiselwe {izinkanyezi} kwezingu {maxstars} izinkanyezi

source: Rating Details
zu: Imininingwane Yokulinganisela

source: Rating Pending
zu: Ukulinganisela Kusalindelwe

source: Rating Refused
zu: Ukulinganisela Kunqabile

source: Read all reviews
zu: Funda zonke izibukezo

source: Receipt
zu: Ilisidi

source: Recommendations
zu: Izincomo

source: Reference
zu: Ireferensi

source: Region
zu: Isizinda

source: Register
zu: Bhalisa

source: Report
zu: Bika

source: Report Abuse
zu: Bika Ukuxhaphaza

source: Report Trademark Abuse
zu: Bika Ukuxhashazwa kwe-Trademark

source: Review
zu: Izibukezo

source: Reviewer Tools
zu: Amathuluzi Okubukeza

source: Review History
zu: Umlando Wokubukeza

source: Reviews
zu: Ukubukeza

source: Russian
zu: IsiRashiya

source: Save Changes
zu: Londoloza Izinguquko

source: Search Marketplace&hellip;
zu: Usesho lwe-Marketplace ne-hellip;

source: Search Results
zu: Imiphumela Yokucinga

source: See an issue with this review? Select a reason below.
zu: Kukhona inkinga oyibonayo ngalesi sibukezo? Khetha isizathu ngezansi.

source: Settings
zu: Amasethingi

source: Settings could not be saved
zu: Amasethingi awakwazanga ukulondolozwa

source: Shopping
zu: Ezokuthenga

source: Sign In
zu: Sayinela ukungena

source: Sign in to review
zu: Sayinela ukungena esibukezweni

source: Sign me up
zu: Ngisayinele ukuthola lokhu

source: Sign Out
zu: Sayinela Ukuphuma

source: Sign up for our newsletter
zu: Sayinela ukuthola incwadindaba

source: Sign up for our newsletter.
zu: Sayinela ukuthola incwadindaba.

source: Social
zu: Ezomphakathi

source: Sorry, there was an error posting your review. Please try again later.
zu: Siyaxolisa, kube nephutha ngenkathi kuposwa isibukezo sakho. Uyacelwa uphinde uzame kabusha.

source: Sorry, there was an issue editing your review. Please try again later
zu: Siyaxolisa, kube nenkinga ngenkathi kuhlelwa isibukezo sakho. Uyacelwa upninde uzame kamuva.

source: Sorry, there was an issue flagging the review. Please try again later.
zu: Siyabonga, kube nenkinga ngenkathi kufakwa ifulegi esibukezweni sakho. Uyacelwa uphinde uzame kabusha.

source: Sorry, there was a problem deleting the review
zu: Siyaxolisa, kube nenkinga ngenkathi kusulwa isibukezo sakho

source: Sorry, we had trouble fetching this app's data. Please try again later.
zu: Siyaxolisa, kube nenkinga ukulanda le mininingwane ye-app. Sicela uphinde uzame kamuva.

source: Sorry, you are currently offline. Please try again later.
zu: Siyaxolisa, njengamanje awukho emoyeni. Uyacelwa uphinde uzame emva kwesikhathi.

source: Sorry, you need to be online to access the Marketplace.
zu: Siyaxolisa, kudingeka ukuthi ube semoyeni ukuze ukwazi ukufinyelela ku-Marketplace.

source: Sorry, your device clock appears to be set incorrectly.
zu: Siyaxolisa, kubonakala sengathi iwashi ledivayisi yakho alihambi kahle.

source: Spam or otherwise non-review content
zu: I-spam noma kungenjalo imininingwane engabukezwa

source: Spanish
zu: IsiPenishi

source: Sports
zu: Ezemidlalo

source: Statistics
zu: Izibalo

source: Submit Feedback
zu: Letha imicabango nemibono yakho

source: Submit Report
zu: Letha Umbiko

source: Submit Review
zu: Letha Isibukezo

source: Support
zu: Ukwesekwa

source: Support Site
zu: Isayithi Yokuthola Usizo

source: System Date Incorrect
zu: Usuku Lwesistimu Alusilo Iqiniso

source: Teen
zu: Intsha esencane

source: Terms of Use
zu: Imogomo Yokusebenzisa

source: Thanks for signing up!
zu: Ngiyabonga ukungisayinela ukuthola lokhu!

source: Thank you for purchasing
zu: Siyabonga ngokuba uthenge

source: The category you requested does not exist.
zu: Isigaba osicelile asikho.

source: The next time you start the Firefox Marketplace app, youll see the updated version!
zu: Ngokulandelayo uma uqala i-app ye-Firefox Marketplace, uzobona sekuyiveshini evuselelwe!

source: There was an error submitting your newsletter sign up request
zu: Kube nephutha ngenkathi kulethwa isicelo sakho sokusayinela incwadindaba

source: There was a problem submitting your feedback. Try again soon.
zu: Kube nenkinga ngenkathi uthumela imbuyisambiko yakho. Phinda uzame futhi kungekudala.

source: This app has no reviews.
zu: Le app ayinazibukezo.

source: This review has been successfully deleted
zu: Lesi sibukezo sesisusiwe ngempumelelo.

source: This review has been successfully flagged. Thanks!
zu: Lesi sibukezo sifakwe ifulegi ngempumelelo. Siyabonga!

source: Tool & Time Saver
zu: Ithuluzi Nokokonga isikhathi

source: Travel
zu: Ezokuvakasha

source: Try again
zu: Zama futhi

source: Try Again
zu: Zama futhi

source: Unable to install packaged apps
zu: Ayikwazanga ukufakela ama-app apakishiwe

source: Unavailable
zu: Akutholakali

source: Update Review
zu: Vuselela Isibukezo

source: Updates
zu: Ukuvuselela

source: Utilities
zu: Izidingo

source: View All
zu: Buka Konke

source: We want to hear from you!
zu: Sifuna ukuzwa okucabangayo!

source: Work & Business App
zu: I-App Yomsebenzi & Amabhizinisi

source: Write a review
zu: Bhala isibukezo

source: Write a Review
zu: Bhala Isibukezo

source: Yes, show me recommendations based on my installed apps. <a href="{url}" target="_blank">Learn more</a>
zu: Yebo, ngikhombise izincomo ngokuhambisana nama-app afakiwe. <a href="{url}" target="_blank">Funda kabanzi</a>

source: You have no apps
zu: Awunama-app

source: You'll receive an email from mozilla@e.mozilla.org, please check your inbox for your first email from us. If you dont see it, check your spam filter.
zu: Uzothola i-imeyli evela ku-mozilla@e.mozilla.org, uyacelwa ubheke iposi lakho le-imeyli elivela kithina. Uma ungaliboni, ubheke ifilth ayakho yeposi eliyimfucuza.

source: You must be signed in to view your apps.
zu: Kufanele ukuba usayinele ukungena ukuze ubuke ama-app akho.

source: You must use Firefox to install Firefox apps.
zu: Kufanele usebenzise i-Firefox ukuze ufake ama-app e-Firefox.

source: Your Mac settings may prevent you from installing apps that do not come from the Mac App Store.
zu: Amasethingi akho e-Mac angase akuvimbe ukuthi ufake ama-app angaphumi ku-Mac App Store.

source: Your review was successfully edited
zu: Isibukezo sakho sihlelwe kahle ngempumelelo.

source: Your review was successfully posted. Thanks!
zu: Isibukezo sakho siposwe ngempumelelo. Siyabonga!

source: Your settings have been successfully saved
zu: Amasethingi alondekile ngempumelelo

source: An error occurred. Close the window to continue
zu: Kube nephutha elenzekile. Vala ikhasi ukuze uqhubeke.

source: An error occurred whilst trying to log out.
zu: Kube nephutha elenzeke ngenkathi uzama ukuphuma.

source: An internal web request timed out.
zu: Isicelo sewebhu yangaphakathi siphelelwe isikhathi.

source: An unexpected error occurred.
zu: Kwenzeke iphutha elingalindelekile.

source: An unexpected error occurred when creating your PIN.
zu: Kube nephutha elingalindelekile elenzeke ngenkathi kuzanywa ukwakha i-PIN yakho.

source: An unexpected error occurred when resetting your PIN.
zu: Kwenzeke iphutha elingalindelekile ngenkathi kusethwa kabusha i-PIN yakho.

source: An unexpected error occurred whilst checking your PIN.
zu: Kwenzeke iphutha elingalindelekile ngenkathi kuhlolwa i-PIN yakho.

source: Are you sure you want to reset your PIN? You must sign in to Firefox Accounts to reset your PIN.
zu: Unesiqinisekiso sokuthi ufuna ukusetha kabusha i-PIN yakho? Kufanele usayinele ukungena ku-Firefox Accounts ukuze usethe kabusha i-PIN yakho.

source: Are you sure you want to reset your PIN? You must sign in to Persona to reset your PIN.
zu: Unesiqinisekiso sokuthi ufuna ukusetha kabusha i-PIN yakho? Kufanele usayinele ukungena ku-Persona ukuze usethe kabusha i-PIN yakho.

source: Back
zu: Emuva

source: Beginning payment
zu: Qala ukukhokha

source: By proceeding you agree to our <a %(terms)s>terms</a> and <a %(privacy)s>Privacy Policy</a>
zu: Ngokuqhubeka uyavumelana <a %(imigomo)>nemigomo</a> kanye<a %(ukuvikelwa kwememininingwane)>Nenqubomgomo Yokuvikelwa kwemininingwane/a>kwethu

source: Completing payment
zu: Isaqedela ukukhokha

source: Completing Payment
zu: Isaqedela ukukhokha

source: Confirm PIN
zu: Qinisekisa i-PIN

source: Connecting to Firefox Accounts
zu: Isaxhumana Nama-akhawunti e-Firefox

source: Connecting to Persona
zu: Isaxhumana Nemininingwane yomuntu

source: Continue
zu: Qhubeka

source: Create a PIN
zu: Yakha i-PIN

source: Create PIN
zu: Yakha i-PIN

source: Enter PIN
zu: Faka i-PIN

source: Error
zu: Iphutha

source: Forgot your PIN?
zu: Ukhohlwe yi-PIN?

source: Initializing
zu: Isaqalisa

source: Loading
zu: Isaloda

source: Logging out
zu: Ulogela ukuphuma

source: No network simulation
zu: Akukho kufaniswa kwamanethiwekhi

source: Not you?
zu: Akuwena?

source: No valid user found whilst attempting to create your PIN
zu: Akekho umsebenzisi ofanelekile otholakele ngenkathi kuzanywa ukwakha i-PIN yakho.

source: No valid user found whilst attempting to reset your PIN
zu: Akekho umsebenzisi ofanelekile otholakele ngenkathi kuzanywa ukusetha kabusha i-PIN yakho.

source: No valid user found whilst checking your PIN
zu: Akekho umsebenzisi ofanelekile otholakele ngenkathi kuhlolwa i-PIN yakho

source: OK
zu: KULUNGILE

source: Payment complete
zu: Ukukhokha kuqediwe

source: Payments are temporarily disabled.
zu: Izinkokhelo zikhutshaziwe okwesikhashana.

source: Permission denied attempting to check your PIN
zu: Imvume yenqatshiwe ngenkathi kuzanywa ukuhlola i-PIN yakho

source: Permission denied attempting to create your PIN.
zu: Imvume yenqantshiwe ngenkathi kuzanywa ukwakha i-PIN yakho.

source: Permission denied attempting to reset your PIN.
zu: Imvume inqatshelwe ngenkathi kuzanywa ukusetha kabusha i-PIN yakho.

source: PIN can only contain digits.
zu: I-PIN ingaqukatha kuphela amadijithi.

source: PIN Locked
zu: I-PIN ikhiyiwe

source: PINs do not match.
zu: Ama-PIN awahambelani.

source: PIN too short
zu: I-PIN imfishane kakhulu

source: Please sign in to reset your PIN.
zu: Uyacelwa usayinele ukungena ukuze usethe kabusha i-PIN yakho.

source: Processing
zu: Isaqhuba uhlelo

source: Product cannot be purchased due to configuration error.
zu: Angeke ukwazi ukuthenga lo mkhiqizo ngenxa yephutha ekuxhumaneni.

source: Reset
zu: Setha kabusha

source: Reset PIN
zu: Setha kabusha i-PIN

source: Reset your PIN?
zu: Ufuna ukusetha kabusha i-PIN?

source: Retrieving Transaction
zu: Kusakhishwa ithranzekshini

source: Retry?
zu: Zama futhi?

source: Retrying
zu: Kusazanywa futhi

source: Setting up payment
zu: Kulungiselela ukukhokha

source: Sign in
zu: Sayinela ukungena

source: Sign in to continue with the payment
zu: Sayinela ukungena ukuze uqhubeke nokukhokha

source: Sign-in to reset PIN
zu: Sayinela ukungena ukuze usethe kabusha i-PIN

source: Simulate Payment
zu: Ukuqalisa ukukhokha

source: Simulate Something?
zu: Ufuna ukwenza kufane nokuthile?

source: Something went wrong.
zu: Kukhona okungahambanga kahle.

source: Something went wrong. Try again?
zu: Kukhona okungahambanga kahle. Uzame futhi?

source: Submit
zu: Thumela

source: Success
zu: Impumelelo

source: Super Simulate
zu: Ukwenza ngokufana ncimishi

source: That took longer than expected. Retry?
zu: Lokhu kuthathe isikhathi eside kunalokho obekulindelekile. Zama futhi?

source: The payment method or price point is not supported for this region or operator.
zu: Indlela yokukhokha noma indawo yokukhokha ayesekiwe yilesi sizinda noma i-operator.

source: The PIN data submitted was invalid.
zu: Imininingwane ye-PIN ebithunyelwe ibingasebenzi.

source: The request timed out whilst attempting to create your PIN.
zu: Isicelo siphelelwe yisikhathi ngenkathi kusazanywa ukwakha i-PIN yakho.

source: The request timed out whilst attempting to reset your PIN.
zu: Isicelo siphelelwe isikhathi ngenkathi kuzanywa ukusetha kabusha i-PIN yakho.

source: The request timed out whilst trying to check your PIN
zu: Isicelo siphelelwe isikhathi ngenkathi kuzanywa ukuhlola i-PIN yakho

source: The system timed out while trying to log in.
zu: Isistimu inqamule isikhathi ngenkathi uzama ukungena.

source: The system timed out while trying to log out.
zu: Isistimu inqamule isikhathi ngenkathi uzama ukuphuma.

source: The transaction failed. You have not been charged for this purchase.
zu: Ithranzekshini ayiphumelelanga. Awukhokhiswanga ngalokhu kuthenga.

source: This is taking longer than expected. Try again?
zu: Lokhu kuthatha isikhathi eside kunobekulindelwe. Uzame futhi?

source: Verifying payment
zu: Kusaqinisekiswa inkokhelo

source: Waiting for login
zu: Kulindelwe ukuba kusayinelwe ukungena

source: Was Locked
zu: Beyikhiyiwe

source: Wrong PIN
zu: I-PIN engesiyo

source: You are signed in as:
zu: Usayinele ukungena njengo:

source: You entered the wrong PIN too many times. Your account is locked. Please try your purchase again in 5 minutes.
zu: Ufake i-PIN engesiyo izikhathi eziningi kakhulu. I-akhawunti yakho ikhiyiwe. Uyacelwa uzame ukuthenga futhi emizuzwini emi-5.
